gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/Libraries/CTWing/ctwingaepcodes.c
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	srcStruct.DateTime					= aep_htoni(srcStruct.DateTime);
	srcStruct.SpotCount					= aep_htons(srcStruct.SpotCount);
	srcStruct.MagneticX					= aep_htons(srcStruct.MagneticX);
	srcStruct.MagneticY					= aep_htons(srcStruct.MagneticY);
	srcStruct.MagneticZ					= aep_htons(srcStruct.MagneticZ);
	srcStruct.MagneticDiff				= aep_htons(srcStruct.MagneticDiff);
	srcStruct.MagneticBackX				= aep_htons(srcStruct.MagneticBackX);
	srcStruct.MagneticBackY				= aep_htons(srcStruct.MagneticBackY);
	srcStruct.MagneticBackZ				= aep_htons(srcStruct.MagneticBackZ);
	srcStruct.Debugval					= aep_htons(srcStruct.Debugval);
	
	index = resultStruct.str;
	
	memcpy(index, "02", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_SPOTSTATUSDATA);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.DateTime, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.SpotCount, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.SpotStatus, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.MagneticX, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.MagneticY, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.MagneticZ, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.MagneticDiff, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.RadarDistance, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.RadarStrength, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.RadarCoverCount, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.RadarDiff, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.NBRssi, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.NBSnr, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.MCUTemp, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.QMCTemp, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.MagneticBackX, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.MagneticBackY, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.MagneticBackZ, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.Debugval, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(srcStruct.Radarval.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Radarval.str, srcStruct.Radarval.len);
	index += srcStruct.Radarval.len * 2;
	
	tempLen = aep_htons(srcStruct.Radarback.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Radarback.str, srcStruct.Radarback.len);
	index += srcStruct.Radarback.len * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_WorkInfo_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepWorkInfo srcStruct)
 @Description			CTWing_WorkInfo_CodeDataReport			: 序列化WorkInfo
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_WorkInfo_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepWorkInfo srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 26 + (srcStruct.WorkMode.len + 2) + (srcStruct.Cmdcnt.len + 2) + (srcStruct.Nbruntime.len + 2) + (srcStruct.APN.len + 2) + (srcStruct.Coef.len + 2);
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	srcStruct.Range					= aep_htons(srcStruct.Range);
	srcStruct.Earfcn					= aep_htoni(srcStruct.Earfcn);
	srcStruct.Tac						= aep_htoni(srcStruct.Tac);
	srcStruct.Ci						= aep_htoni(srcStruct.Ci);
	
	index = resultStruct.str;
	
	memcpy(index, "02", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_WORKINFO);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)srcStruct.SN, 8);
	index += 8 * 2;
	
	HexToStr(index, (char *)&srcStruct.Sense, 1);
	index += 1 * 2;
	
	tempLen = aep_htons(srcStruct.WorkMode.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.WorkMode.str, srcStruct.WorkMode.len);
	index += srcStruct.WorkMode.len * 2;
	
	HexToStr(index, (char *)&srcStruct.RfChannel, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.Range, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.Earfcn, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.Tac, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.Ci, 4);
	index += 4 * 2;
	
	tempLen = aep_htons(srcStruct.Cmdcnt.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Cmdcnt.str, srcStruct.Cmdcnt.len);
	index += srcStruct.Cmdcnt.len * 2;
	
	tempLen = aep_htons(srcStruct.Nbruntime.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Nbruntime.str, srcStruct.Nbruntime.len);
	index += srcStruct.Nbruntime.len * 2;
	
	tempLen = aep_htons(srcStruct.APN.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.APN.str, srcStruct.APN.len);
	index += srcStruct.APN.len * 2;
	
	tempLen = aep_htons(srcStruct.Coef.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Coef.str, srcStruct.Coef.len);
	index += srcStruct.Coef.len * 2;
	
	HexToStr(index, (char *)&srcStruct.Rollinit, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.RadioRv, 1);
	index += 1 * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_BasicInfo_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepBasicInfo srcStruct)
 @Description			CTWing_BasicInfo_CodeDataReport			: 序列化BasicInfo
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_BasicInfo_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepBasicInfo srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 10 + (srcStruct.ModelType.len + 2) 
							 + (srcStruct.Vender.len + 2) 
							 + (srcStruct.Hard.len + 2) 
							 + (srcStruct.Soft.len + 2) 
							 + (srcStruct.Sim.len + 2) 
							 + (srcStruct.Imei.len + 2) 
							 + (srcStruct.Imsi.len + 2) 
							 + (srcStruct.Nbvender.len + 2) 
							 + (srcStruct.Nbmode.len + 2) 
							 + (srcStruct.Boot.len + 2) 
							 + (srcStruct.Ver.len + 2);
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
