gdgly/stm32L151_nbiot_tmote_app_workspace/stm32L151_nbiot_tmote_app_spot/Libraries/CTWing/ctwingaepcodes.c
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	index = resultStruct.str;
	
	memcpy(index, "02", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_BASICINFO);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)srcStruct.SN, 8);
	index += 8 * 2;
	
	tempLen = aep_htons(srcStruct.ModelType.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.ModelType.str, srcStruct.ModelType.len);
	index += srcStruct.ModelType.len * 2;
	
	tempLen = aep_htons(srcStruct.Vender.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Vender.str, srcStruct.Vender.len);
	index += srcStruct.Vender.len * 2;
	
	tempLen = aep_htons(srcStruct.Hard.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Hard.str, srcStruct.Hard.len);
	index += srcStruct.Hard.len * 2;
	
	tempLen = aep_htons(srcStruct.Soft.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Soft.str, srcStruct.Soft.len);
	index += srcStruct.Soft.len * 2;
	
	tempLen = aep_htons(srcStruct.Sim.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Sim.str, srcStruct.Sim.len);
	index += srcStruct.Sim.len * 2;
	
	tempLen = aep_htons(srcStruct.Imei.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Imei.str, srcStruct.Imei.len);
	index += srcStruct.Imei.len * 2;
	
	tempLen = aep_htons(srcStruct.Imsi.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Imsi.str, srcStruct.Imsi.len);
	index += srcStruct.Imsi.len * 2;
	
	tempLen = aep_htons(srcStruct.Nbvender.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Nbvender.str, srcStruct.Nbvender.len);
	index += srcStruct.Nbvender.len * 2;
	
	tempLen = aep_htons(srcStruct.Nbmode.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Nbmode.str, srcStruct.Nbmode.len);
	index += srcStruct.Nbmode.len * 2;
	
	tempLen = aep_htons(srcStruct.Boot.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Boot.str, srcStruct.Boot.len);
	index += srcStruct.Boot.len * 2;
	
	tempLen = aep_htons(srcStruct.Ver.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Ver.str, srcStruct.Ver.len);
	index += srcStruct.Ver.len * 2;
	
	HexToStr(index, (char *)&srcStruct.Rmold, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.Rvcc, 1);
	index += 1 * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_DynamicInfo_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepDynamicInfo srcStruct)
 @Description			CTWing_DynamicInfo_CodeDataReport			: 序列化DynamicInfo
 @Input				pClient								: CTWing客户端实例
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_DynamicInfo_CodeDataReport(CTWING_ClientsTypeDef* pClient, AepDynamicInfo srcStruct)
{
	char* index;
	AepString resultStruct;
	
	unsigned short tempLen;
	unsigned short payloadLen = 26 + (srcStruct.RAlib.len + 2) + (srcStruct.Nbrun.len + 2) + (srcStruct.Gain.len + 2) + (srcStruct.x.len + 2) + (srcStruct.y.len + 2) + (srcStruct.z.len + 2);
	
	memset((void *)pClient->AepMallocProcessStack, 0x0, sizeof(pClient->AepMallocProcessStack));
	
	resultStruct.len = (1 + 2 + 2 + payloadLen) * 2;
	resultStruct.str = (char *)pClient->AepMallocProcessStack;
	
	srcStruct.RT						= aep_htoni(srcStruct.RT);
	srcStruct.Batt						= aep_htons(srcStruct.Batt);
	srcStruct.Rcnt						= aep_htoni(srcStruct.Rcnt);
	srcStruct.Temp						= aep_htons(srcStruct.Temp);
	srcStruct.Qmcrbt					= aep_htons(srcStruct.Qmcrbt);
	
	index = resultStruct.str;
	
	memcpy(index, "02", 2);
	index += 1 * 2;
	
	tempLen = aep_htons(AEP_SERVICE_ID_DYNAMICINFO);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(payloadLen);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)srcStruct.SN, 8);
	index += 8 * 2;
	
	HexToStr(index, (char *)&srcStruct.RT, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.Batt, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(srcStruct.RAlib.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.RAlib.str, srcStruct.RAlib.len);
	index += srcStruct.RAlib.len * 2;
	
	HexToStr(index, (char *)&srcStruct.Rcnt, 4);
	index += 4 * 2;
	
	HexToStr(index, (char *)&srcStruct.Temp, 2);
	index += 2 * 2;
	
	HexToStr(index, (char *)&srcStruct.Qmcrbt, 2);
	index += 2 * 2;
	
	tempLen = aep_htons(srcStruct.Nbrun.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Nbrun.str, srcStruct.Nbrun.len);
	index += srcStruct.Nbrun.len * 2;
	
	HexToStr(index, (char *)&srcStruct.Indelay, 1);
	index += 1 * 2;
	
	tempLen = aep_htons(srcStruct.Gain.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.Gain.str, srcStruct.Gain.len);
	index += srcStruct.Gain.len * 2;
	
	HexToStr(index, (char *)&srcStruct.Smode, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.Sinter, 1);
	index += 1 * 2;
	
	HexToStr(index, (char *)&srcStruct.hpass, 1);
	index += 1 * 2;
	
	tempLen = aep_htons(srcStruct.x.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.x.str, srcStruct.x.len);
	index += srcStruct.x.len * 2;
	
	tempLen = aep_htons(srcStruct.y.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.y.str, srcStruct.y.len);
	index += srcStruct.y.len * 2;
	
	tempLen = aep_htons(srcStruct.z.len);
	HexToStr(index, (char *)&tempLen, 2);
	index += 2 * 2;
	HexToStr(index, (char *)srcStruct.z.str, srcStruct.z.len);
	index += srcStruct.z.len * 2;
	
	return resultStruct;
}

/**********************************************************************************************************
 @Function			AepString CTWing_CodeDataReportByIdToStr(CTWING_ClientsTypeDef* pClient, int serviceId, void * srcStruct)
 @Description			CTWing_CodeDataReportByIdToStr			: 序列化数据包
 @Input				pClient								: CTWing客户端实例
					serviceId
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_CodeDataReportByIdToStr(CTWING_ClientsTypeDef* pClient, int serviceId, void * srcStruct)
{
	if (serviceId == AEP_SERVICE_ID_SPOTSTATUSDATA) {
		return CTWing_SpotStatusData_CodeDataReport(pClient, *(AepSpotStatusData*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_WORKINFO) {
		return CTWing_WorkInfo_CodeDataReport(pClient, *(AepWorkInfo*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_BASICINFO) {
		return CTWing_BasicInfo_CodeDataReport(pClient, *(AepBasicInfo*)srcStruct);
	}
	else if (serviceId == AEP_SERVICE_ID_DYNAMICINFO) {
		return CTWing_DynamicInfo_CodeDataReport(pClient, *(AepDynamicInfo*)srcStruct);
	}
	else {
		AepString result = {0};
		return result;
	}
}

/**********************************************************************************************************
 @Function			AepBytes CTWing_CodeDataReportByIdToBytes(CTWING_ClientsTypeDef* pClient, int serviceId, void * srcStruct)
 @Description			CTWing_CodeDataReportByIdToBytes			: 序列化数据包
 @Input				pClient								: CTWing客户端实例
					serviceId
					srcStruct
 @Return				void
**********************************************************************************************************/
AepBytes CTWing_CodeDataReportByIdToBytes(CTWING_ClientsTypeDef* pClient, int serviceId, void * srcStruct)
{
	AepString tempStr = CTWing_CodeDataReportByIdToStr(pClient, serviceId, srcStruct);
	AepBytes result = {0};
	result.len = tempStr.len / 2;
	if (result.len > 0) {
		memset((void *)pClient->DataProcessStack, 0x0, sizeof(pClient->DataProcessStack));
		result.str = (char *)pClient->DataProcessStack;
		StrToHex(result.str, tempStr.str, result.len);
	}
	
	return result;
}

/**********************************************************************************************************
 @Function			AepString CTWing_CodeDataReportByIdentifierToStr(CTWING_ClientsTypeDef* pClient, char* serviceIdentifier, void * srcStruct)
 @Description			CTWing_CodeDataReportByIdentifierToStr		: 序列化数据包
 @Input				pClient								: CTWing客户端实例
					serviceIdentifier
					srcStruct
 @Return				void
**********************************************************************************************************/
AepString CTWing_CodeDataReportByIdentifierToStr(CTWING_ClientsTypeDef* pClient, char* serviceIdentifier, void * srcStruct)
{
	if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_SPOTSTATUSDATA) == 0) {
		return CTWing_SpotStatusData_CodeDataReport(pClient, *(AepSpotStatusData*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_WORKINFO) == 0) {
		return CTWing_WorkInfo_CodeDataReport(pClient, *(AepWorkInfo*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_BASICINFO) == 0) {
		return CTWing_BasicInfo_CodeDataReport(pClient, *(AepBasicInfo*)srcStruct);
	}
	else if (strcmp(serviceIdentifier, AEP_SERVICE_ENTIFIER_DYNAMICINFO) == 0) {
		return CTWing_DynamicInfo_CodeDataReport(pClient, *(AepDynamicInfo*)srcStruct);
	}
	else {
		AepString result = {0};
		return result;
	}
}

/**********************************************************************************************************
 @Function			AepBytes CTWing_CodeDataReportByIdentifierToBytes(CTWING_ClientsTypeDef* pClient, char* serviceIdentifier, void * srcStruct)
 @Description			CTWing_CodeDataReportByIdentifierToBytes	: 序列化数据包
 @Input				pClient								: CTWing客户端实例
					serviceIdentifier
					srcStruct
 @Return				void
**********************************************************************************************************/
AepBytes CTWing_CodeDataReportByIdentifierToBytes(CTWING_ClientsTypeDef* pClient, char* serviceIdentifier, void * srcStruct)
{
	AepString tempStr = CTWing_CodeDataReportByIdentifierToStr(pClient, serviceIdentifier, srcStruct);
	AepBytes result = {0};
	result.len = tempStr.len / 2;
	if (result.len > 0) {
		memset((void *)pClient->DataProcessStack, 0x0, sizeof(pClient->DataProcessStack));
		result.str = (char *)pClient->DataProcessStack;
		StrToHex(result.str, tempStr.str, result.len);
	}
	
	return result;
}

/********************************************** END OF FLEE **********************************************/
